export const phoneNumber = "+7 (918) 214-22-45";

export const mockDataItems = [
  {
    id: 1,
    title: "JCB 3CX SITEMASTER",
    subtitle: "экскаватор-погрузчик",

    price: "14 900 000",
    nds: "20%",

    parameters: [
      {
        id: 1,
        text: "Год производства:",
        value: "2023",
      },
      {
        id: 2,
        text: "Полная мощность:",
        value: "92 л.с",
      },
      {
        id: 3,
        text: "Ковш:",
        value: "(стандартный) погрузчик: 1 м3 (лопата 6в1)",
      },
      {
        id: 4,
        text: "Обратная лопата:",
        value: "0,3 м3",
      },
      {
        id: 5,
        text: "Глубина копания, мм (макс.):",
        value: "5 970",
      },
      {
        id: 6,
        text: "Эксплуатационная масса:",
        value: "8 578 кг",
      },
    ],

    details: [
      "Обогреватель и кондиционер",
      "Телескопический удлиненный ковш",
      "Многофункциональная передняя лопата",
      "Многофункциональная передняя лопата",
      "Дополнительный ковш экскаватора 400 мм",
      "Гидравлические трубопроводы для навесного оборудования",
      "Многофункциональная передняя лопата",
      "Многофункциональная передняя лопата",
      "Дополнительный ковш экскаватора 400 мм",
      "Гидравлические трубопроводы для навесного оборудования",
      "Многофункциональная передняя лопата",
      "Многофункциональная передняя лопата",
      "Дополнительный ковш экскаватора 400 мм",
      "Гидравлические трубопроводы для навесного оборудования",
    ],
    img: "/img/mainSlider/1.png",
    imgCatalog: "/img/catalog/1.png",
  },
  {
    id: 2,
    title: "JCB 3CX SITEMASTER",
    subtitle: "экскаватор-погрузчик",

    price: "14 900 000",
    nds: "20%",

    parameters: [
      {
        id: 1,
        text: "Год производства:",
        value: "2023",
      },
      {
        id: 2,
        text: "Полная мощность:",
        value: "92 л.с",
      },
      {
        id: 3,
        text: "Ковш:",
        value: "(стандартный) погрузчик: 1 м3 (лопата 6в1)",
      },
      {
        id: 4,
        text: "Обратная лопата:",
        value: "0,3 м3",
      },
      {
        id: 5,
        text: "Глубина копания, мм (макс.):",
        value: "5 970",
      },
      {
        id: 6,
        text: "Эксплуатационная масса:",
        value: "8 578 кг",
      },
    ],

    details: [
      "Обогреватель и кондиционер",
      "Телескопический удлиненный ковш",
      "Многофункциональная передняя лопата",
      "Многофункциональная передняя лопата",
      "Дополнительный ковш экскаватора 400 мм",
      "Гидравлические трубопроводы для навесного оборудования",
    ],

    img: "/img/mainSlider/1.png",
    imgCatalog: "/img/catalog/1.png",
  },
  {
    id: 3,
    title: "JCB 3CX SITEMASTER",
    subtitle: "экскаватор-погрузчик",

    price: "14 900 000",
    nds: "20%",

    parameters: [
      {
        id: 1,
        text: "Год производства:",
        value: "2023",
      },
      {
        id: 2,
        text: "Полная мощность:",
        value: "92 л.с",
      },
      {
        id: 3,
        text: "Ковш:",
        value: "(стандартный) погрузчик: 1 м3 (лопата 6в1)",
      },
      {
        id: 4,
        text: "Обратная лопата:",
        value: "0,3 м3",
      },
      {
        id: 5,
        text: "Глубина копания, мм (макс.):",
        value: "5 970",
      },
      {
        id: 6,
        text: "Эксплуатационная масса:",
        value: "8 578 кг",
      },
    ],

    details: [
      "Обогреватель и кондиционер",
      "Телескопический удлиненный ковш",
      "Многофункциональная передняя лопата",
      "Многофункциональная передняя лопата",
      "Дополнительный ковш экскаватора 400 мм",
      "Гидравлические трубопроводы для навесного оборудования",
    ],

    img: "/img/mainSlider/1.png",
    imgCatalog: "/img/catalog/1.png",
  },
];

export type MockDataItem = (typeof mockDataItems)[0];
